# OpenIFCDocument Method (String) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Application..::..OpenIFCDocument Method (String)
Application Class See Also
---
Opens an IFC document from disk using default options.
**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Document OpenIFCDocument(
	string fileName
)
```

Visual Basic
---
```text
Public Function OpenIFCDocument ( _
	fileName As String _
) As Document
```

Visual C++
---
```text
public:
Document^ OpenIFCDocument(
	String^ fileName
)
```

# ### Parameters
fileName
    Type: System..::..String The IFC file to be opened.
# ### Return Value
The newly created document containing the IFC file.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | If 'fileName' is an empty string. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | If nullNothingnullptra null reference (Nothing in Visual Basic) is passed as 'fileName' -or- A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..FileArgumentNotFoundException | If the file specified by 'fileName' cannot be found. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | If Revit is missing document templates or if the file cannot be opened. |

# See Also
Application Class
OpenIFCDocument Overload
Autodesk.Revit.ApplicationServices Namespace